websocket.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "tsung-1.0.dtd">
<tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="127.0.0.1" port="8080" type="tcp"/>
  </servers>

  <monitoring>
    <monitor host="localhost"/>
  </monitoring>

  <load>
    <arrivalphase phase="1" duration="5" unit="minute">
      <users interarrival="1" unit="second"></users>
    </arrivalphase>
  </load>

  <sessions>
    <session probability="100" name="ws" type="ts_websocket">

        <request>
          <websocket type="connect" url="/"/>
        </request>

        <thinktime value="1"/>

        <request>
          <websocket type="send">{"message": "login", "api_key": "s3cr3t"}</websocket>
        </request>

        <thinktime value="1"/>

        <request>
          <!-- don't wait for a response from the server, hence ack="no_ack" -->
          <websocket type="send" ack="no_ack">{"message": "data", "value": 3}</websocket>
        </request>

        <for from="1" to="10" incr="1" var="i">
          <thinktime value="1"/>

          <request>
            <websocket type="ping">ping</websocket>
          </request>
        </for>

        <thinktime value="1"/>

        <request>
          <websocket type="close">{"message": "bye"}</websocket>
        </request>

    </session>
  </sessions>
</tsung>